// 1 Выведите в консоль четные числа от 2 до 12, используйте цикл for и условие.

// for (let i = 2; i <= 12; i = i + 2) {
//     console.log(`Пройден ${i} круг`)
// }

// 2 При помощи цикла for выведите в консоль числа от 10 до 1, в обратном порядке.

// let i = 0

// for (let i=10; i > 0; i--) {
//     console.log(i)
// }

// 3 Перепишите 1 и 2 цикл используя цикл while.


// let i = 0
// while (i <= 12) {
//     console.log(`Пройден ${i} круг`);
//     i + 2;
// }

// let i = 0
// while (i > 0) {
//     console.log(i);
//     i--;
// }
