// 1 Выведите в консоль четные числа от 2 до 12, используйте цикл for и условие.

// for (let i = 2; i <= 12; i = i + 2) {
//     console.log('Пройден ${i} круг')
// }

// 2 При помощи цикла for выведите в консоль числа от 10 до 1, в обратном порядке.

// let i = 0

// for (let i=1; i > 10; i++) {
//     console.log(i)
// }

// 3 Перепишите 1 и 2 цикл используя цикл while.

// let i = 0

// while(let i = 2; i <= 12; i = i + 2) {
//     console.log('Пройден ${i} круг')
//     for (let i=1; i > 10; i++) {
//     console.log(i)
// } 